tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "teamookla/speedtest"
# Vector graphics library with cross-device output support
brew "cairo"
# Emacs dependency management
brew "cask"
# Access VS Code through the browser
brew "code-server", restart_service: true
# GNU File, Shell, and Text utilities
brew "coreutils"
# Modern replacement for 'ls'
brew "exa"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Improved top (interactive process viewer)
brew "htop"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# NCurses Disk Usage
brew "ncdu"
# Realtime console network usage monitor
brew "nload"
# Manage multiple Node.js versions
brew "nvm"
# Development kit for the Java programming language
brew "openjdk"
# PlayStation Portable emulator
brew "ppsspp"
# Monitor data's progress through a pipe
brew "pv"
# CLI for extracting streams from various websites to a video player
brew "streamlink"
# Extract, view, and test RAR archives
brew "unrar"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
cask "gearboy"
# Web browser
cask "google-chrome"
# Open-source video transcoder
cask "handbrake"
# Terminal built on web technologies
cask "hyper"
# Collaboration platform for API development
cask "postman"
# Free and open-source IDE for Python programming - Community Edition
cask "pycharm-ce"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Desktop client for WhatsApp
cask "whatsapp"
